Types of Variables

Measure of Central Tendency

Encoding Techniques 

Handle Nan Value

Implementing using python

Categorical --

1. Nominal
2. Dichotomous 
3. Ordinal


Continuous --

1.

In [2]:
import pandas as pd

In [3]:
import numpy as np

In [6]:
df = pd.read_csv('online.csv')

df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

# Categorical value convert to numerical value

In [9]:
# check is there any null value

df.isnull().sum()

Marketing Spend    0
Administration     0
Transport          0
Area               0
Profit             0
dtype: int64

Ff there is any null value

How to handle null value

you can use mean or median

mean = df.Transport.mean()

median = df.Transport.median()


#### For fillup the null value 

df['Transport'] = df['Transport'].fillna(median)

In [16]:
df.isnull().sum()

Marketing Spend    0
Administration     0
Transport          0
Area               0
Profit             0
dtype: int64

There is no null value.

# Encoding

In [17]:
df.Area.unique()

array(['Dhaka', 'Ctg', 'Rangpur'], dtype=object)

In [19]:
df.Area = df.Area.replace(['Dhaka', 'Ctg', 'Rangpur'],[3,2,1])

In [21]:
df.Area.head()

0    3
1    2
2    1
3    3
4    1
Name: Area, dtype: int64

# Label Encoding

In [25]:
from sklearn.preprocessing import LabelEncoder
df = pd.read_csv('online.csv')

In [23]:
label = LabelEncoder()

In [26]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [28]:
df.Area = label.fit_transform(df['Area'])

In [31]:
df.head()

   Marketing Spend  Administration  Transport  Area     Profit
0        114523.61       136897.80  471784.10     1  192261.83
1        162597.70       151377.59  443898.53     0  191792.06
2        153441.51       101145.55  407934.54     2  191050.39
3        144372.41       118671.85  383199.62     1  182901.99
4        142107.34        91391.77  366168.42     2  166187.94

In [59]:
#Using loop
for column in df.columns:
    print(column)
    if df[column].dtype == np.number:
        continue
    df[column] = LabelEncoder().fit_transform(df[column])

Marketing Spend
Administration
Transport
Profit
1
2

/tmp/ipykernel_96673/3749100811.py:4: DeprecationWarning: Converting `np.inexact` or `np.floating` to a dtype is deprecated. The current result is `float64` which is not strictly correct.
  if df[column].dtype == np.number:

In [35]:
df.Area.head()

0    1
1    0
2    2
3    1
4    2
Name: Area, dtype: int64

# One Hot encoding

In [44]:
dummy_varialbes = pd.get_dummies(df['Area'],drop_first = True)

In [45]:
dummy_varialbes.head()

   1  2
0  1  0
1  0  0
2  0  1
3  1  0
4  0  1

In [46]:
new_df = df.drop('Area',axis = 1)

In [47]:
new_df.head()

   Marketing Spend  Administration  Transport     Profit
0        114523.61       136897.80  471784.10  192261.83
1        162597.70       151377.59  443898.53  191792.06
2        153441.51       101145.55  407934.54  191050.39
3        144372.41       118671.85  383199.62  182901.99
4        142107.34        91391.77  366168.42  166187.94

In [55]:
df = pd.concat([new_df,dummy_varialbes],axis = 1)

In [56]:
df.head()

   Marketing Spend  Administration  Transport     Profit  1  2
0        114523.61       136897.80  471784.10  192261.83  1  0
1        162597.70       151377.59  443898.53  191792.06  0  0
2        153441.51       101145.55  407934.54  191050.39  0  1
3        144372.41       118671.85  383199.62  182901.99  1  0
4        142107.34        91391.77  366168.42  166187.94  0  1

# Ordinal Encoder

In [62]:
df = pd.read_csv('online.csv')
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [68]:
from sklearn.preprocessing import OrdinalEncoder

In [69]:
df.Area.unique()

array(['Dhaka', 'Ctg', 'Rangpur'], dtype=object)

In [72]:
# First create list 
city_list = ['Dhaka', 'Ctg', 'Rangpur']

In [75]:
ordinal = OrdinalEncoder(categories=[city_list])

In [81]:
encoded_values= ordinal.fit_transform(df[['Area']]) # number of sample and number of feature

array([[0.],
       [1.],
       [2.],
       [0.],
       [2.],
       [0.],
       [1.],
       [2.],
       [0.],
       [1.],
       [2.],
       [1.],
       [2.],
       [1.],
       [2.],
       [0.],
       [1.],
       [0.],
       [2.],
       [0.],
       [1.],
       [0.],
       [2.],
       [2.],
       [0.],
       [1.],
       [2.],
       [0.],
       [2.],
       [0.],
       [2.],
       [0.],
       [1.],
       [2.],
       [1.],
       [0.],
       [2.],
       [1.],
       [0.],
       [1.],
       [1.],
       [2.],
       [1.],
       [0.],
       [1.],
       [0.],
       [2.],
       [1.],
       [0.],
       [1.]])

In [86]:
new_area = pd.DataFrame(encoded_values, columns = ['Area'])

In [87]:
df.Area = new_area

In [88]:
df.head()

   Marketing Spend  Administration  Transport  Area     Profit
0        114523.61       136897.80  471784.10   0.0  192261.83
1        162597.70       151377.59  443898.53   1.0  191792.06
2        153441.51       101145.55  407934.54   2.0  191050.39
3        144372.41       118671.85  383199.62   0.0  182901.99
4        142107.34        91391.77  366168.42   2.0  166187.94

Home work

In [90]:
new_df = df.drop('Area',axis = 1)

In [97]:
new_df = pd.concat([new_df,dummy_varialbes],axis = 1)

# Hasing

In [98]:
import category_encoders as ce

ModuleNotFoundError: No module named 'category_encoders'

In [100]:
d=pd.read_csv('pima.csv')

In [101]:
d.head()

  num_preg,glucose_conc,diastolic_bp,thickness,insulin,bmi,diab_pred,age,skin,diabetes
0             6,148,72,35,0,33.6,0.627,50,1.379,TRUE
1            1,85,66,29,0,26.6,0.351,31,1.1426,FALSE
2                  8,183,64,0,0,23.3,0.672,32,0,TRUE
3           1,89,66,23,94,28.1,0.167,21,0.9062,FALSE
4           0,137,40,35,168,43.1,2.288,33,1.379,TRUE